Revit 2027 API
PropertyTableEntryArcDirection Enumeration
 An enumerated type that represents the arc directions supported in an Arc table entry for a PropertyLine element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PropertyTableEntryArcDirection
Public Enumeration PropertyTableEntryArcDirection
public enum class PropertyTableEntryArcDirection
type PropertyTableEntryArcDirection
Members
Member name | Value | Description
Left | 0 |  The arc proceeds to the left of the corresponding line segment.
Right | 1 |  The arc proceeds to the right of the corresponding line segment.
See Also
Reference
Autodesk.Revit.DB Namespace